{
  "verses": [
    {
      "verse_num": 1,
      "text_full": "אָ֣ז יָשִֽׁיר־מֹשֶׁה֩ וּבְנֵ֨י יִשְׂרָאֵ֜ל אֶת־הַשִּׁירָ֤ה הַזֹּאת֙ לַֽיהֹוָ֔ה וַיֹּאמְר֖וּ לֵאמֹ֑ר אָשִׁ֤ירָה לַֽיהֹוָה֙ כִּֽי־גָאֹ֣ה גָּאָ֔ה ס֥וּס וְרֹכְב֖וֹ רָמָ֥ה בַיָּֽם׃",
      "text_clean": "אז ישיר־משה ובני ישראל את־השירה הזאת ליהוה ויאמרו לאמר אשירה ליהוה כי־גאה גאה סוס ורכבו רמה בים",
      "targum": "בְּכֵן שַׁבַּח משֶׁה וּבְנֵי יִשְׂרָאֵל יָת תִּשְׁבַּחְתָּא הָדָא קֳדָם יְיָ וַאֲמָרוּ לְמֵימָר נְשַׁבַּח וְנוֹדֵי קָדָם יְיָ אֲרֵי אִתְגָאֵי עַל גֵוְתָנַיָא וְגֵאוּתָא דִילֵהּ הִיא סוּסְיָא וְרָכְבֵהּ רְמָא בְיַמָא:"
    },
    {
      "verse_num": 2,
      "text_full": "עׇזִּ֤י וְזִמְרָת֙ יָ֔הּ וַֽיְהִי־לִ֖י לִֽישׁוּעָ֑ה זֶ֤ה אֵלִי֙ וְאַנְוֵ֔הוּ אֱלֹהֵ֥י אָבִ֖י וַאֲרֹמְמֶֽנְהוּ׃",
      "text_clean": "עזי וזמרת יה ויהי־לי לישועה זה אלי ואנוהו אלהי אבי וארממנהו",
      "targum": "תָּקְפִּי וְתֻשְׁבַּחְתִּי דְחִילָא יְיָ וַאֲמַר בְּמֵימְרֵהּ וַהֲוָה לִי לְפָרָק דֵין אֱלָהַי וְאֶבְנֵי לֵהּ מַקְדְשָׁא אֱלָהָא דַאֲבָהָתַי וְאֶפְלַח קֳדָמוֹהִי:"
    },
    {
      "verse_num": 3,
      "text_full": "יְהֹוָ֖ה אִ֣ישׁ מִלְחָמָ֑ה יְהֹוָ֖ה שְׁמֽוֹ׃",
      "text_clean": "יהוה איש מלחמה יהוה שמו",
      "targum": "יְיָ מָרֵי נִצְחָן קְרָבַיָא יְיָ שְׁמֵהּ:"
    },
    {
      "verse_num": 4,
      "text_full": "מַרְכְּבֹ֥ת פַּרְעֹ֛ה וְחֵיל֖וֹ יָרָ֣ה בַיָּ֑ם וּמִבְחַ֥ר שָֽׁלִשָׁ֖יו טֻבְּע֥וּ בְיַם־סֽוּף׃",
      "text_clean": "מרכבת פרעה וחילו ירה בים ומבחר שלשיו טבעו בים־סוף",
      "targum": "רְתִכֵּי פַּרְעֹה וּמַשִׁרְיָתֵהּ שְׁדִי בְיַמָא וּשְׁפַר גִבָּרוֹהִי אִטְבָּעוּ בְּיַמָא דְסוּף:"
    },
    {
      "verse_num": 5,
      "text_full": "תְּהֹמֹ֖ת יְכַסְיֻ֑מוּ יָרְד֥וּ בִמְצוֹלֹ֖ת כְּמוֹ־אָֽבֶן׃",
      "text_clean": "תהמת יכסימו ירדו במצולת כמו־אבן",
      "targum": "תְּהוֹמַיָא חֲפוֹ עֲלֵיהוֹן נְחָתוּ לְעוּמְקַיָא כְּאַבְנָא:"
    },
    {
      "verse_num": 6,
      "text_full": "יְמִֽינְךָ֣ יְהֹוָ֔ה נֶאְדָּרִ֖י בַּכֹּ֑חַ יְמִֽינְךָ֥ יְהֹוָ֖ה תִּרְעַ֥ץ אוֹיֵֽב׃",
      "text_clean": "ימינך יהוה נאדרי בכח ימינך יהוה תרעץ אויב",
      "targum": "יַמִינָךְ יְיָ אַדִירָא בְּחֵילָא יַמִינָךְ יְיָ תְּבָרַת סָנְאָה:"
    },
    {
      "verse_num": 7,
      "text_full": "וּבְרֹ֥ב גְּאוֹנְךָ֖ תַּהֲרֹ֣ס קָמֶ֑יךָ תְּשַׁלַּח֙ חֲרֹ֣נְךָ֔ יֹאכְלֵ֖מוֹ כַּקַּֽשׁ׃",
      "text_clean": "וברב גאונך תהרס קמיך תשלח חרנך יאכלמו כקש",
      "targum": "וּבִסְגֵי תָקְפָּךְ תְּבַרְתָּנוּן לִדְקָמוּ עַל עַמָךְ שַׁלַחְתָּ רוּגְזָךְ שֵׁיצִיתִינוּן כְּנוּרָא לְקַשָׁא:"
    },
    {
      "verse_num": 8,
      "text_full": "וּבְר֤וּחַ אַפֶּ֙יךָ֙ נֶ֣עֶרְמוּ מַ֔יִם נִצְּב֥וּ כְמוֹ־נֵ֖ד נֹזְלִ֑ים קָֽפְא֥וּ תְהֹמֹ֖ת בְּלֶב־יָֽם׃",
      "text_clean": "וברוח אפיך נערמו מים נצבו כמו־נד נזלים קפאו תהמת בלב־ים",
      "targum": "וּבְמֵימַר פּוּמָךְ חַכִּימוּ מַיָא קָמוּ כְשׁוּר אֲזָלַיָא קָפוּ תְהוֹמִין בְּלִבָּא דְיַמָא:"
    },
    {
      "verse_num": 9,
      "text_full": "אָמַ֥ר אוֹיֵ֛ב אֶרְדֹּ֥ף אַשִּׂ֖יג אֲחַלֵּ֣ק שָׁלָ֑ל תִּמְלָאֵ֣מוֹ נַפְשִׁ֔י אָרִ֣יק חַרְבִּ֔י תּוֹרִישֵׁ֖מוֹ יָדִֽי׃",
      "text_clean": "אמר אויב ארדף אשיג אחלק שלל תמלאמו נפשי אריק חרבי תורישמו ידי",
      "targum": "דַהֲוָה אֲמַר סָנְאָה אֶרְדוֹף אַדְבֵּק אֲפַלֵג בִּזְתָא תִּשְׂבַּע מִנְהוֹן נַפְשִׁי אֶשְׁלוֹף חַרְבִּי תְּשֵׁיצִינוּן יְדִי:"
    },
    {
      "verse_num": 10,
      "text_full": "נָשַׁ֥פְתָּ בְרוּחֲךָ֖ כִּסָּ֣מוֹ יָ֑ם צָֽלְלוּ֙ כַּֽעוֹפֶ֔רֶת בְּמַ֖יִם אַדִּירִֽים׃",
      "text_clean": "נשפת ברוחך כסמו ים צללו כעופרת במים אדירים",
      "targum": "אֲמַרְתָּ בְּמֵימְרָךְ חֲפָא עֲלֵיהוֹן יַמָא אִשְׁתְּקָעוּ כַּאֲבָרָא בְּמַיִן תַּקִיפִין:"
    },
    {
      "verse_num": 11,
      "text_full": "מִֽי־כָמֹ֤כָה בָּֽאֵלִם֙ יְהֹוָ֔ה מִ֥י כָּמֹ֖כָה נֶאְדָּ֣ר בַּקֹּ֑דֶשׁ נוֹרָ֥א תְהִלֹּ֖ת עֹ֥שֵׂה פֶֽלֶא׃",
      "text_clean": "מי־כמכה באלם יהוה מי כמכה נאדר בקדש נורא תהלת עשה פלא",
      "targum": "לֵית בַּר מִנָךְ דְאַתְּ הוּא אֱלָהָא יְיָ לֵית בַּר מִנָךְ אֱלָהָא אַתְּ אַדִיר בְּקוּדְשָׁא דְחֵל תֻּשְׁבְּחָן עָבֵד פָּרִישָׁן:"
    },
    {
      "verse_num": 12,
      "text_full": "נָטִ֙יתָ֙ יְמִ֣ינְךָ֔ תִּבְלָעֵ֖מוֹ אָֽרֶץ׃",
      "text_clean": "נטית ימינך תבלעמו ארץ",
      "targum": "אֲרֵמְתָּ יַמִינָךְ בְּלָעָתְנוּן אַרְעָא:"
    },
    {
      "verse_num": 13,
      "text_full": "נָחִ֥יתָ בְחַסְדְּךָ֖ עַם־ז֣וּ גָּאָ֑לְתָּ נֵהַ֥לְתָּ בְעׇזְּךָ֖ אֶל־נְוֵ֥ה קׇדְשֶֽׁךָ׃",
      "text_clean": "נחית בחסדך עם־זו גאלת נהלת בעזך אל־נוה קדשך",
      "targum": "דַבַּרְהִי בְטַבְוָתָךְ עַמָא דְנַן דִפְרָקְתָּ סוֹבַרְהִי בְתָקְפָּךְ לְדִירָא דְקֻדְשָׁךְ:"
    },
    {
      "verse_num": 14,
      "text_full": "שָֽׁמְע֥וּ עַמִּ֖ים יִרְגָּז֑וּן חִ֣יל אָחַ֔ז יֹשְׁבֵ֖י פְּלָֽשֶׁת׃",
      "text_clean": "שמעו עמים ירגזון חיל אחז ישבי פלשת",
      "targum": "שְׁמָעוּ עַמְמַיָא וְזָעוּ דַחֲלָא אַחֲדָתְנוּן לְדַהַווֹ יָתְבִין בִּפְלָשֶׁת:"
    },
    {
      "verse_num": 15,
      "text_full": "אָ֤ז נִבְהֲלוּ֙ אַלּוּפֵ֣י אֱד֔וֹם אֵילֵ֣י מוֹאָ֔ב יֹֽאחֲזֵ֖מוֹ רָ֑עַד נָמֹ֕גוּ כֹּ֖ל יֹשְׁבֵ֥י כְנָֽעַן׃",
      "text_clean": "אז נבהלו אלופי אדום אילי מואב יאחזמו רעד נמגו כל ישבי כנען",
      "targum": "בְּכֵן אִתְבְּהִילוּ רַבְרְבֵי אֱדוֹם תַּקִיפֵי מוֹאָב אֲחַדָתְנוּן רְתֵיתָא אִתְבָּרוּ כֹּל דַהֲווֹ יָתְבִין בִּכְנָעַן:"
    },
    {
      "verse_num": 16,
      "text_full": "תִּפֹּ֨ל עֲלֵיהֶ֤ם אֵימָ֙תָה֙ וָפַ֔חַד בִּגְדֹ֥ל זְרוֹעֲךָ֖ יִדְּמ֣וּ כָּאָ֑בֶן עַד־יַעֲבֹ֤ר עַמְּךָ֙ יְהֹוָ֔ה עַֽד־יַעֲבֹ֖ר עַם־ז֥וּ קָנִֽיתָ׃",
      "text_clean": "תפל עליהם אימתה ופחד בגדל זרועך ידמו כאבן עד־יעבר עמך יהוה עד־יעבר עם־זו קנית",
      "targum": "תַּפֵּיל עֲלֵיהוֹן אֵימְתָא וְדַחַלְתָּא בִּסְגֵי תָקְפָּךְ יִשְׁתְּקוּן כְּאַבְנָא עַד דְיֵעִבַּר עַמָךְ יְיָ יָת אַרְנוֹנָא עַד דְיֵעִבַּר עַמָא דְנַן דִי פְרַקְתָּא יָת יַרְדְנָא:"
    },
    {
      "verse_num": 17,
      "text_full": "תְּבִאֵ֗מוֹ וְתִטָּעֵ֙מוֹ֙ בְּהַ֣ר נַחֲלָֽתְךָ֔ מָכ֧וֹן לְשִׁבְתְּךָ֛ פָּעַ֖לְתָּ יְהֹוָ֑ה מִקְּדָ֕שׁ אֲדֹנָ֖י כּוֹנְנ֥וּ יָדֶֽיךָ׃",
      "text_clean": "תבאמו ותטעמו בהר נחלתך מכון לשבתך פעלת יהוה מקדש אדני כוננו ידיך",
      "targum": "תָּעֵלִנוּן וְתַשְׁרִינוּן בְּטוּרָא דְאַחְסַנְתָּךְ אֲתַר מְתַקֵן לְבֵית שְׁכִנְתָּךְ אַתְקֵנְתָּא יְיָ מַקְדְשָׁא יְיָ אַתְקְנוֹהִי יְדָיךְ:"
    },
    {
      "verse_num": 18,
      "text_full": "יְהֹוָ֥ה ׀ יִמְלֹ֖ךְ לְעֹלָ֥ם וָעֶֽד׃",
      "text_clean": "יהוה  ימלך לעלם ועד",
      "targum": "יְיָ מַלְכוּתֵהּ קָאֵם לְעָלַם וּלְעָלְמֵי עָלְמַיָא:"
    },
    {
      "verse_num": 19,
      "text_full": "כִּ֣י בָא֩ ס֨וּס פַּרְעֹ֜ה בְּרִכְבּ֤וֹ וּבְפָרָשָׁיו֙ בַּיָּ֔ם וַיָּ֧שֶׁב יְהֹוָ֛ה עֲלֵהֶ֖ם אֶת־מֵ֣י הַיָּ֑ם וּבְנֵ֧י יִשְׂרָאֵ֛ל הָלְכ֥וּ בַיַּבָּשָׁ֖ה בְּת֥וֹךְ הַיָּֽם׃ {פ}",
      "text_clean": "כי בא סוס פרעה ברכבו ובפרשיו בים וישב יהוה עלהם את־מי הים ובני ישראל הלכו ביבשה בתוך הים {פ}",
      "targum": "אֲרֵי עַל סוּסָוַת פַּרְעֹה בִּרְתִכּוֹהִי וּבְפָרָשׁוֹהִי בְּיַמָא וַאֲתֵיב יְיָ עֲלֵיהוֹן יָת מֵי יַמָא וּבְנֵי יִשְׂרָאֵל הַלִיכוּ בְיַבֶּשְׁתָּא בְּגוֹ יַמָא:"
    },
    {
      "verse_num": 20,
      "text_full": "וַתִּקַּח֩ מִרְיָ֨ם הַנְּבִיאָ֜ה אֲח֧וֹת אַהֲרֹ֛ן אֶת־הַתֹּ֖ף בְּיָדָ֑הּ וַתֵּצֶ֤אןָ כׇֽל־הַנָּשִׁים֙ אַחֲרֶ֔יהָ בְּתֻפִּ֖ים וּבִמְחֹלֹֽת׃",
      "text_clean": "ותקח מרים הנביאה אחות אהרן את־התף בידה ותצאן כל־הנשים אחריה בתפים ובמחלת",
      "targum": "וּנְסֵיבַת מִרְיָם נְבִיאֲתָא אֲחָתֵהּ דְאַהֲרֹן יָת תֻּפָּא בִּידַהּ וּנְפָקוּ כָל נְשַׁיָא בַּתְרָהָא בְּתֻפִּין וּבְחִנְגִין:"
    },
    {
      "verse_num": 21,
      "text_full": "וַתַּ֥עַן לָהֶ֖ם מִרְיָ֑ם שִׁ֤ירוּ לַֽיהֹוָה֙ כִּֽי־גָאֹ֣ה גָּאָ֔ה ס֥וּס וְרֹכְב֖וֹ רָמָ֥ה בַיָּֽם׃ {ס}",
      "text_clean": "ותען להם מרים שירו ליהוה כי־גאה גאה סוס ורכבו רמה בים {ס}",
      "targum": "וּמְעַנְיָא לָהֶן מִרְיָם שַׁבָּחוּ וְאוֹדוּ קֳדָם יְיָ אֲרֵי אִתְגָאֵי עַל גֵוְתָנַיָא וְגֵאוּתָא דִילֵהּ הִיא סוּסְיָא וְרָכְבֵהּ רְמָא בְיַמָא:"
    },
    {
      "verse_num": 22,
      "text_full": "וַיַּסַּ֨ע מֹשֶׁ֤ה אֶת־יִשְׂרָאֵל֙ מִיַּם־ס֔וּף וַיֵּצְא֖וּ אֶל־מִדְבַּר־שׁ֑וּר וַיֵּלְכ֧וּ שְׁלֹֽשֶׁת־יָמִ֛ים בַּמִּדְבָּ֖ר וְלֹא־מָ֥צְאוּ מָֽיִם׃",
      "text_clean": "ויסע משה את־ישראל מים־סוף ויצאו אל־מדבר־שור וילכו שלשת־ימים במדבר ולא־מצאו מים",
      "targum": "וְאַטֵל משֶׁה יָת יִשְׂרָאֵל מִיַמָא דְסוּף וּנְפָקוּ לְמַדְבְּרָא דְחַגְרָא וַאֲזָלוּ תְלָתָא יוֹמִין בְּמַדְבְּרָא וְלָא אַשְׁכָּחוּ מַיָא:"
    },
    {
      "verse_num": 23,
      "text_full": "וַיָּבֹ֣אוּ מָרָ֔תָה וְלֹ֣א יָֽכְל֗וּ לִשְׁתֹּ֥ת מַ֙יִם֙ מִמָּרָ֔ה כִּ֥י מָרִ֖ים הֵ֑ם עַל־כֵּ֥ן קָרָֽא־שְׁמָ֖הּ מָרָֽה׃",
      "text_clean": "ויבאו מרתה ולא יכלו לשתת מים ממרה כי מרים הם על־כן קרא־שמה מרה",
      "targum": "וַאֲתוֹ לְמָרָה וְלָא יְכִילוּ לְמִשְׁתֵּי מַיָא מִמָרָה אֲרֵי מְרִירִין אִנוּן עַל כֵּן קְרָא שְׁמַהּ מָרָה:"
    },
    {
      "verse_num": 24,
      "text_full": "וַיִּלֹּ֧נוּ הָעָ֛ם עַל־מֹשֶׁ֥ה לֵּאמֹ֖ר מַה־נִּשְׁתֶּֽה׃",
      "text_clean": "וילנו העם על־משה לאמר מה־נשתה",
      "targum": "וְאִתְרָעָמוּ עַמָא עַל משֶׁה לְמֵימַר מָה נִשְׁתֵּי:"
    },
    {
      "verse_num": 25,
      "text_full": "וַיִּצְעַ֣ק אֶל־יְהֹוָ֗ה וַיּוֹרֵ֤הוּ יְהֹוָה֙ עֵ֔ץ וַיַּשְׁלֵךְ֙ אֶל־הַמַּ֔יִם וַֽיִּמְתְּק֖וּ הַמָּ֑יִם שָׁ֣ם שָׂ֥ם ל֛וֹ חֹ֥ק וּמִשְׁפָּ֖ט וְשָׁ֥ם נִסָּֽהוּ׃",
      "text_clean": "ויצעק אל־יהוה ויורהו יהוה עץ וישלך אל־המים וימתקו המים שם שם לו חק ומשפט ושם נסהו",
      "targum": "וְצַלִי קֳדָם יְיָ וְאַלְפֵהּ יְיָ אָעָא וּרְמָא לְמַיָא וּבַסִימוּ מַיָא תַּמָן גְזַר לֵהּ קְיָם וְדִין וְתַמָן נַסְיֵהּ:"
    },
    {
      "verse_num": 26,
      "text_full": "וַיֹּ֩אמֶר֩ אִם־שָׁמ֨וֹעַ תִּשְׁמַ֜ע לְק֣וֹל ׀ יְהֹוָ֣ה אֱלֹהֶ֗יךָ וְהַיָּשָׁ֤ר בְּעֵינָיו֙ תַּעֲשֶׂ֔ה וְהַֽאֲזַנְתָּ֙ לְמִצְוֺתָ֔יו וְשָׁמַרְתָּ֖ כׇּל־חֻקָּ֑יו כׇּֽל־הַמַּחֲלָ֞ה אֲשֶׁר־שַׂ֤מְתִּי בְמִצְרַ֙יִם֙ לֹא־אָשִׂ֣ים עָלֶ֔יךָ כִּ֛י אֲנִ֥י יְהֹוָ֖ה רֹפְאֶֽךָ׃ {ס}",
      "text_clean": "ויאמר אם־שמוע תשמע לקול  יהוה אלהיך והישר בעיניו תעשה והאזנת למצותיו ושמרת כל־חקיו כל־המחלה אשר־שמתי במצרים לא־אשים עליך כי אני יהוה רפאך {ס}",
      "targum": "וַאֲמַר אִם קַבָּלָא תְקַבֵּל לְמֵימְרָא דַיְיָ אֱלָהָךְ וּדְכָשַׁר קֳדָמוֹהִי תַעְבֵּד וְתַצֵית לִפִקוּדוֹהִי וְתִטַר כָּל קְיָמוֹהִי כָּל מַרְעִין דִי שַׁוֵיתִי בְמִצְרַיִם לָא אֲשַׁוֵי עֲלָךְ אֲרֵי אֲנָא יְיָ אַסָךְ:"
    },
    {
      "verse_num": 27,
      "text_full": "וַיָּבֹ֣אוּ אֵילִ֔מָה וְשָׁ֗ם שְׁתֵּ֥ים עֶשְׂרֵ֛ה עֵינֹ֥ת מַ֖יִם וְשִׁבְעִ֣ים תְּמָרִ֑ים וַיַּחֲנוּ־שָׁ֖ם עַל־הַמָּֽיִם׃",
      "text_clean": "ויבאו אילמה ושם שתים עשרה עינת מים ושבעים תמרים ויחנו־שם על־המים",
      "targum": "וַאֲתוֹ לְאֵילִם וְתַמָן תְּרֵי עֲסַר מַבּוּעִין דְמַיִן וְשִׁבְעִין דִקְלִין וּשְׁרוֹ תַמָן עַל מַיָא:"
    }
  ]
}